let list = ['い', 'ろ', 'は', 'に', 'ほ', 'へ', 'と'];
let list2 = ['い', 'ろ', 'は', 'に', 'ほ', 'へ', 'と'];
let list3 = ['い', 'ろ', 'は', 'に', 'ほ', 'へ', 'と'];
let list4 = ['い', 'ろ', 'は', 'に', 'ほ', 'へ', 'と'];

console.log(list.copyWithin(3, 2, 4));
    //結果：['い', 'ろ', 'は', 'は', 'に', 'へ', 'と']
console.log(list2.copyWithin(1, 2));
    //結果：['い', 'は', 'に', 'ほ', 'へ', 'と', 'と']
console.log(list3.copyWithin(2));
    //結果：['い', 'ろ', 'い', 'ろ', 'は', 'に', 'ほ']
console.log(list4.copyWithin(3, -6, -3));
    //結果：['い', 'ろ', 'は', 'ろ', 'は', 'に', 'と']